benchmarks/results/stress-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/allanflavio/Documents/projects/PERSONAL/backend-challenges/fiscalbridge-rails-nfse-platform/benchmarks/stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 1m20s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/30 VUs  0m00.3s/1m20.0s

running (0m02.0s), 01/30 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 01/30 VUs  0m01.3s/1m20.0s

running (0m03.0s), 02/30 VUs, 11 complete and 0 interrupted iterations
default   [   3% ] 02/30 VUs  0m02.3s/1m20.0s

running (0m04.0s), 02/30 VUs, 23 complete and 0 interrupted iterations
default   [   4% ] 02/30 VUs  0m03.3s/1m20.0s

running (0m05.0s), 02/30 VUs, 33 complete and 0 interrupted iterations
default   [   5% ] 02/30 VUs  0m04.3s/1m20.0s

running (0m06.0s), 03/30 VUs, 51 complete and 0 interrupted iterations
default   [   7% ] 03/30 VUs  0m05.3s/1m20.0s

running (0m07.0s), 03/30 VUs, 69 complete and 0 interrupted iterations
default   [   8% ] 03/30 VUs  0m06.3s/1m20.0s

running (0m08.0s), 04/30 VUs, 91 complete and 0 interrupted iterations
default   [   9% ] 04/30 VUs  0m07.3s/1m20.0s

running (0m09.0s), 04/30 VUs, 113 complete and 0 interrupted iterations
default   [  10% ] 04/30 VUs  0m08.3s/1m20.0s

running (0m10.0s), 05/30 VUs, 138 complete and 0 interrupted iterations
default   [  12% ] 05/30 VUs  0m09.3s/1m20.0s

running (0m11.0s), 05/30 VUs, 170 complete and 0 interrupted iterations
default   [  13% ] 05/30 VUs  0m10.3s/1m20.0s

running (0m12.0s), 06/30 VUs, 201 complete and 0 interrupted iterations
default   [  14% ] 06/30 VUs  0m11.3s/1m20.0s

running (0m13.0s), 06/30 VUs, 230 complete and 0 interrupted iterations
default   [  15% ] 06/30 VUs  0m12.3s/1m20.0s

running (0m14.0s), 06/30 VUs, 264 complete and 0 interrupted iterations
default   [  17% ] 06/30 VUs  0m13.3s/1m20.0s

running (0m15.0s), 07/30 VUs, 304 complete and 0 interrupted iterations
default   [  18% ] 07/30 VUs  0m14.3s/1m20.0s

running (0m16.0s), 07/30 VUs, 339 complete and 0 interrupted iterations
default   [  19% ] 07/30 VUs  0m15.3s/1m20.0s

running (0m17.0s), 08/30 VUs, 368 complete and 0 interrupted iterations
default   [  20% ] 08/30 VUs  0m16.3s/1m20.0s

running (0m18.0s), 08/30 VUs, 398 complete and 0 interrupted iterations
default   [  22% ] 08/30 VUs  0m17.3s/1m20.0s

running (0m19.0s), 09/30 VUs, 438 complete and 0 interrupted iterations
default   [  23% ] 09/30 VUs  0m18.3s/1m20.0s

running (0m20.0s), 09/30 VUs, 479 complete and 0 interrupted iterations
default   [  24% ] 09/30 VUs  0m19.3s/1m20.0s

running (0m21.0s), 10/30 VUs, 507 complete and 0 interrupted iterations
default   [  25% ] 10/30 VUs  0m20.3s/1m20.0s

running (0m22.0s), 10/30 VUs, 552 complete and 0 interrupted iterations
default   [  27% ] 10/30 VUs  0m21.3s/1m20.0s

running (0m23.0s), 11/30 VUs, 586 complete and 0 interrupted iterations
default   [  28% ] 11/30 VUs  0m22.3s/1m20.0s

running (0m24.0s), 11/30 VUs, 629 complete and 0 interrupted iterations
default   [  29% ] 11/30 VUs  0m23.3s/1m20.0s

running (0m25.0s), 12/30 VUs, 657 complete and 0 interrupted iterations
default   [  30% ] 12/30 VUs  0m24.3s/1m20.0s

running (0m26.0s), 12/30 VUs, 704 complete and 0 interrupted iterations
default   [  32% ] 12/30 VUs  0m25.3s/1m20.0s

running (0m27.0s), 13/30 VUs, 737 complete and 0 interrupted iterations
default   [  33% ] 13/30 VUs  0m26.3s/1m20.0s

running (0m28.0s), 13/30 VUs, 778 complete and 0 interrupted iterations
default   [  34% ] 13/30 VUs  0m27.3s/1m20.0s

running (0m29.0s), 14/30 VUs, 810 complete and 0 interrupted iterations
default   [  35% ] 14/30 VUs  0m28.3s/1m20.0s

running (0m30.0s), 14/30 VUs, 845 complete and 0 interrupted iterations
default   [  37% ] 14/30 VUs  0m29.3s/1m20.0s

running (0m31.0s), 15/30 VUs, 881 complete and 0 interrupted iterations
default   [  38% ] 15/30 VUs  0m30.3s/1m20.0s

running (0m32.0s), 15/30 VUs, 918 complete and 0 interrupted iterations
default   [  39% ] 15/30 VUs  0m31.3s/1m20.0s

running (0m33.0s), 16/30 VUs, 953 complete and 0 interrupted iterations
default   [  40% ] 16/30 VUs  0m32.3s/1m20.0s

running (0m34.0s), 16/30 VUs, 984 complete and 0 interrupted iterations
default   [  42% ] 16/30 VUs  0m33.3s/1m20.0s

running (0m35.0s), 17/30 VUs, 1022 complete and 0 interrupted iterations
default   [  43% ] 17/30 VUs  0m34.3s/1m20.0s

running (0m36.0s), 17/30 VUs, 1056 complete and 0 interrupted iterations
default   [  44% ] 17/30 VUs  0m35.3s/1m20.0s

running (0m37.0s), 18/30 VUs, 1099 complete and 0 interrupted iterations
default   [  45% ] 18/30 VUs  0m36.3s/1m20.0s

running (0m38.0s), 18/30 VUs, 1138 complete and 0 interrupted iterations
default   [  47% ] 18/30 VUs  0m37.3s/1m20.0s

running (0m39.0s), 19/30 VUs, 1187 complete and 0 interrupted iterations
default   [  48% ] 19/30 VUs  0m38.3s/1m20.0s

running (0m40.0s), 19/30 VUs, 1230 complete and 0 interrupted iterations
default   [  49% ] 19/30 VUs  0m39.3s/1m20.0s

running (0m41.0s), 20/30 VUs, 1273 complete and 0 interrupted iterations
default   [  50% ] 20/30 VUs  0m40.3s/1m20.0s

running (0m42.0s), 20/30 VUs, 1317 complete and 0 interrupted iterations
default   [  52% ] 20/30 VUs  0m41.3s/1m20.0s

running (0m43.0s), 21/30 VUs, 1348 complete and 0 interrupted iterations
default   [  53% ] 21/30 VUs  0m42.3s/1m20.0s

running (0m44.0s), 21/30 VUs, 1396 complete and 0 interrupted iterations
default   [  54% ] 21/30 VUs  0m43.3s/1m20.0s

running (0m45.0s), 22/30 VUs, 1435 complete and 0 interrupted iterations
default   [  55% ] 22/30 VUs  0m44.3s/1m20.0s

running (0m46.0s), 22/30 VUs, 1479 complete and 0 interrupted iterations
default   [  57% ] 22/30 VUs  0m45.3s/1m20.0s

running (0m47.0s), 23/30 VUs, 1521 complete and 0 interrupted iterations
default   [  58% ] 23/30 VUs  0m46.3s/1m20.0s

running (0m48.0s), 23/30 VUs, 1553 complete and 0 interrupted iterations
default   [  59% ] 23/30 VUs  0m47.3s/1m20.0s

running (0m49.0s), 24/30 VUs, 1585 complete and 0 interrupted iterations
default   [  60% ] 24/30 VUs  0m48.3s/1m20.0s

running (0m50.0s), 24/30 VUs, 1611 complete and 0 interrupted iterations
default   [  62% ] 24/30 VUs  0m49.3s/1m20.0s

running (0m51.0s), 25/30 VUs, 1657 complete and 0 interrupted iterations
default   [  63% ] 25/30 VUs  0m50.3s/1m20.0s

running (0m52.0s), 25/30 VUs, 1688 complete and 0 interrupted iterations
default   [  64% ] 25/30 VUs  0m51.3s/1m20.0s

running (0m53.0s), 26/30 VUs, 1721 complete and 0 interrupted iterations
default   [  65% ] 26/30 VUs  0m52.3s/1m20.0s

running (0m54.0s), 26/30 VUs, 1751 complete and 0 interrupted iterations
default   [  67% ] 26/30 VUs  0m53.3s/1m20.0s

running (0m55.0s), 27/30 VUs, 1786 complete and 0 interrupted iterations
default   [  68% ] 27/30 VUs  0m54.3s/1m20.0s

running (0m56.0s), 27/30 VUs, 1816 complete and 0 interrupted iterations
default   [  69% ] 27/30 VUs  0m55.3s/1m20.0s

running (0m57.0s), 28/30 VUs, 1836 complete and 0 interrupted iterations
default   [  70% ] 28/30 VUs  0m56.3s/1m20.0s

running (0m58.0s), 28/30 VUs, 1853 complete and 0 interrupted iterations
default   [  72% ] 28/30 VUs  0m57.3s/1m20.0s

running (0m59.0s), 29/30 VUs, 1882 complete and 0 interrupted iterations
default   [  73% ] 29/30 VUs  0m58.3s/1m20.0s

running (1m00.0s), 29/30 VUs, 1908 complete and 0 interrupted iterations
default   [  74% ] 29/30 VUs  0m59.3s/1m20.0s

running (1m01.0s), 30/30 VUs, 1944 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  1m00.3s/1m20.0s

running (1m02.0s), 29/30 VUs, 1978 complete and 0 interrupted iterations
default   [  77% ] 29/30 VUs  1m01.3s/1m20.0s

running (1m03.0s), 28/30 VUs, 2015 complete and 0 interrupted iterations
default   [  78% ] 28/30 VUs  1m02.3s/1m20.0s

running (1m04.0s), 26/30 VUs, 2062 complete and 0 interrupted iterations
default   [  79% ] 26/30 VUs  1m03.3s/1m20.0s

running (1m05.0s), 24/30 VUs, 2103 complete and 0 interrupted iterations
default   [  80% ] 24/30 VUs  1m04.3s/1m20.0s

running (1m06.0s), 23/30 VUs, 2147 complete and 0 interrupted iterations
default   [  82% ] 23/30 VUs  1m05.3s/1m20.0s

running (1m07.0s), 21/30 VUs, 2190 complete and 0 interrupted iterations
default   [  83% ] 21/30 VUs  1m06.3s/1m20.0s

running (1m08.0s), 20/30 VUs, 2232 complete and 0 interrupted iterations
default   [  84% ] 20/30 VUs  1m07.3s/1m20.0s

running (1m09.0s), 19/30 VUs, 2264 complete and 0 interrupted iterations
default   [  85% ] 19/30 VUs  1m08.3s/1m20.0s

running (1m10.0s), 17/30 VUs, 2302 complete and 0 interrupted iterations
default   [  87% ] 17/30 VUs  1m09.3s/1m20.0s

running (1m11.0s), 15/30 VUs, 2338 complete and 0 interrupted iterations
default   [  88% ] 15/30 VUs  1m10.3s/1m20.0s

running (1m12.0s), 14/30 VUs, 2373 complete and 0 interrupted iterations
default   [  89% ] 14/30 VUs  1m11.3s/1m20.0s

running (1m13.0s), 12/30 VUs, 2409 complete and 0 interrupted iterations
default   [  90% ] 12/30 VUs  1m12.3s/1m20.0s

running (1m14.0s), 11/30 VUs, 2442 complete and 0 interrupted iterations
default   [  92% ] 11/30 VUs  1m13.3s/1m20.0s

running (1m15.0s), 09/30 VUs, 2469 complete and 0 interrupted iterations
default   [  93% ] 09/30 VUs  1m14.3s/1m20.0s

running (1m16.0s), 08/30 VUs, 2505 complete and 0 interrupted iterations
default   [  94% ] 08/30 VUs  1m15.3s/1m20.0s

running (1m17.0s), 06/30 VUs, 2536 complete and 0 interrupted iterations
default   [  95% ] 06/30 VUs  1m16.3s/1m20.0s

running (1m18.0s), 05/30 VUs, 2559 complete and 0 interrupted iterations
default   [  97% ] 05/30 VUs  1m17.3s/1m20.0s

running (1m19.0s), 03/30 VUs, 2581 complete and 0 interrupted iterations
default   [  98% ] 03/30 VUs  1m18.3s/1m20.0s

running (1m20.0s), 02/30 VUs, 2598 complete and 0 interrupted iterations
default   [  99% ] 02/30 VUs  1m19.3s/1m20.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5209    64.556493/s
    checks_succeeded...: 100.00% 5209 out of 5209
    checks_failed......: 0.00%   0 out of 5209

    ✓ bootstrap created
    ✓ fiscal profile created
    ✓ customer created
    ✓ invoice created
    ✓ invoice read

    HTTP
    http_req_duration..............: avg=179.29ms min=4.05ms   med=154.1ms  max=1.05s p(90)=359.57ms p(95)=467.19ms p(99)=617.58ms
      { expected_response:true }...: avg=179.29ms min=4.05ms   med=154.1ms  max=1.05s p(90)=359.57ms p(95)=467.19ms p(99)=617.58ms
    http_req_failed................: 0.00%  0 out of 5209
    http_reqs......................: 5209   64.556493/s

    EXECUTION
    iteration_duration.............: avg=459.75ms min=122.05ms med=421.28ms max=1.49s p(90)=820.4ms  p(95)=937.95ms p(99)=1.27s   
    iterations.....................: 2603   32.259656/s
    vus............................: 2      min=1         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 10 MB  125 kB/s
    data_sent......................: 1.8 MB 23 kB/s



running (1m20.7s), 00/30 VUs, 2603 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  1m20s